<?php
require_once('init.php');
InfoHTML::OutputHeader('開発履歴 / 2.3', 1, 'develop_history');
?>
<p><a href="history.php">最新情報</a></p>
<p>
Ver. 2.3.x<br>
<a href="#ver231">1</a>
<a href="#ver232">2</a>
</p>
<p>
Ver. 2.3.0<br>
<a href="#ver230rc1">RC1</a>
<a href="#ver230">Release</a>
</p>
<p>
<a href="#ver230a1">α1</a>
<a href="#ver230a2">α2</a>
<a href="#ver230a3">α3</a>
<a href="#ver230a4">α4</a>
<a href="#ver230a5">α5</a>
<a href="#ver230a6">α6</a>
<a href="#ver230a7">α7</a>
<a href="#ver230b1">β1</a>
<a href="#ver230b2">β2</a>
</p>

<h2 id="ver232">Ver. 2.3.2 (Rev. 1233) : 2014/10/30 (Thu) 01:22</h2>
<ul>
<li>愛人を恋人カウントするバグ修正ほか</li>
</ul>

<h2 id="ver231">Ver. 2.3.1 (Rev. 1089) : 2014/04/27 (Sun) 19:05</h2>
<ul>
<li>一部のオプションで背徳者希望ができないバグ修正ほか</li>
</ul>

<h2 id="ver230">Ver. 2.3.0 (Rev. 1041) : 2014/01/12 (Sun) 00:00</h2>
<ul>
<li>天候「雷雨」の仕様変更</li>
</ul>

<h2 id="ver230rc1">Ver. 2.3.0 RC1 (Rev. 1025) : 2013/12/31 (Tue) 01:00</h2>
<ul>
<li>「異議あり」実行時の性別を記録する仕様に変更</li>
<li>天候確率変動を変更</li>
<li>天候「宵月」「寒波」「野分」「時化」「細雪」実装</li>
</ul>

<h2 id="ver230b2">Ver. 2.3.0 β2 (Rev. 1012) : 2013/12/24 (Tue) 01:26</h2>
<ul>
<li>「後援者村」オプション実装</li>
<li>出現率変動モード：I(強心村)・J(封呪村)・K(封夢村)追加</li>
</ul>

<h2 id="ver230b1">Ver. 2.3.0 β1 (Rev. 1003) : 2013/12/16 (Mon) 02:11</h2>
<ul>
<li>固定配役追加モード：C(吸血村)仕様変更</li>
<li>「狂人追加」「妖狐なし」「背徳者登場」オプション実装</li>
<li>固定配役追加モード：S(霊能村)追加</li>
</ul>

<h2 id="ver230a7">Ver. 2.3.0 α7 (Rev. 988) : 2013/12/05 (Thu) 00:52</h2>
<ul>
<li>トップページのデータ配置構造変更</li>
<li>固定配役追加モード：M(暗殺村)仕様変更</li>
<li>出現率変動モード：D(封蘇村)仕様変更</li>
<li>「一寸法師」「雷神」「風神」実装</li>
<li>サブ役職「護衛貫通」実装</li>
</ul>

<h2 id="ver230a6">Ver. 2.3.0 α6 (Rev. 972) : 2013/11/10 (Sun) 23:22</h2>
<ul>
<li>「ろくろ首」「天探女」実装</li>
</ul>

<h2 id="ver230a5">Ver. 2.3.0 α5 (Rev. 951) : 2013/10/14 (Mon) 03:31</h2>
<ul>
<li>「背徳者系」「覚醒者」「夢語部」の仕様変更</li>
<li>「蜜狼」「琵琶牧々」「琴古主」実装</li>
</ul>

<h2 id="ver230a4">Ver. 2.3.0 α4 (Rev. 937) : 2013/09/16 (Mon) 22:14</h2>
<ul>
<li>「覚醒者」「夢語部」「織姫」の仕様変更</li>
<li>「背徳者」「頭人」「伊呂具秦公」実装</li>
</ul>

<h2 id="ver230a3">Ver. 2.3.0 α3 (Rev. 926) : 2013/09/08 (Sun) 19:19</h2>
<ul>
<li>「特殊耐性能力者」の仕様変更</li>
<li>「蝉蝙蝠」「絡新婦」実装</li>
<li>サブ役職「愛人」実装</li>
</ul>

<h2 id="ver230a2">Ver. 2.3.0 α2 (Rev. 896) : 2013/08/18 (Sun) 23:39</h2>
<ul>
<li>システムメッセージ設定ファイルの再編成</li>
<li>「魂移使村」オプション実装</li>
<li>「難題」の仕様変更</li>
<li>「彦星」実装</li>
<li>サブ役職「織姫」実装</li>
</ul>

<h2 id="ver230a1">Ver. 2.3.0 α1 (Rev. 883) : 2013/07/15 (Mon) 04:01</h2>
<ul>
<li>初期化処理を最適化</li>
<li>データベース構造(カラムの型)を最適化</li>
<li>データキャッシュ機能：リセット判定を再設計</li>
<li>憑依+恋人後追い処理の仕様変更</li>
</ul>
</body>
</html>
